RentFlow/modelo_logico/modelo_logico_rentflow.md
```dbml
Table CATEGORIA {
  id_cat int [pk]
  nome varchar
  valor_diaria decimal
}

Table VEICULO {
  placa varchar [pk]
  renavam varchar
  marca varchar
  modelo varchar
  cor varchar
  ano_fabricacao int
  tipo_combustivel varchar
  km_atual int
  nivel_combustivel int
  status varchar
  id_cat int [ref: > CATEGORIA.id_cat]
}

Table CLIENTE {
  cpf varchar [pk]
  nome varchar
  data_nascimento date
  email varchar
  inadimplente boolean
  cnh_numero varchar
  cnh_categoria varchar
  cnh_validade date
  rua varchar
  numero varchar
  bairro varchar
  cidade varchar
  estado varchar
  cep varchar
}

Table TELEFONE_CLIENTE {
  cpf_cliente varchar [pk, ref: > CLIENTE.cpf]
  numero varchar [pk]
  tipo varchar
}

Table FUNCIONARIO {
  id_func int [pk]
  cpf varchar
  nome varchar
}

Table ATENDENTE {
  id_func int [pk, ref: - FUNCIONARIO.id_func]
}

Table GERENTE {
  id_func int [pk, ref: - FUNCIONARIO.id_func]
}

Table SEGURO {
  id_seguro int [pk]
  nome varchar
  descricao_cobertura text
  valor_diario decimal
}

Table LOCACAO {
  id_loc int [pk]
  status varchar
  data_reserva datetime
  data_retirada datetime
  data_devol_prevista datetime
  data_devol_real datetime
  valor_total decimal
  cpf_cliente varchar [ref: > CLIENTE.cpf]
  placa_veiculo varchar [ref: > VEICULO.placa]
  id_seguro int [ref: > SEGURO.id_seguro]
  id_atendente_registro int [ref: > ATENDENTE.id_func]
  id_gerente_autoriza int [ref: > GERENTE.id_func] // Nullable
}

Table VISTORIA {
  id_vistoria int [pk]
  tipo varchar
  data_hora datetime
  km int
  nivel_combustivel int
  observacoes text
  id_loc int [ref: > LOCACAO.id_loc]
  id_func_vistoriador int [ref: > FUNCIONARIO.id_func]
}

Table PAGAMENTO {
  id_pagamento int [pk]
  forma_pagamento varchar
  valor decimal
  data_pagamento datetime
  id_loc int [ref: > LOCACAO.id_loc]
}

Table COBRANCA_EXTRA {
  id_cobranca int [pk]
  tipo varchar
  descricao text
  valor decimal
  id_loc int [ref: > LOCACAO.id_loc]
  id_vistoria_origem int [ref: > VISTORIA.id_vistoria] // Nullable
}

Table MANUTENCAO {
  id_manut int [pk]
  tipo varchar
  motivo varchar
  descricao text
  data_entrada datetime
  previsao_saida datetime
  data_saida_real datetime
  custo decimal
  placa_veiculo varchar [ref: > VEICULO.placa]
  id_func_registro int [ref: > FUNCIONARIO.id_func]
}
```
